7zip
acpi
alacritty
amd-ucode
archcraft-backgrounds
archcraft-backgrounds-branding
archcraft-config-geany
archcraft-config-music
archcraft-cursor-fluent
archcraft-cursor-future
archcraft-cursor-layan
archcraft-cursor-lyra
archcraft-cursor-material
archcraft-cursor-pear
archcraft-cursor-qogirr
archcraft-cursor-sweet
archcraft-cursor-vimix
archcraft-dunst-icons
archcraft-fonts
archcraft-funscripts
archcraft-grub-theme
archcraft-gtk-theme-adapta
archcraft-gtk-theme-arc
archcraft-gtk-theme-blade
archcraft-gtk-theme-catppuccin
archcraft-gtk-theme-cyberpunk
archcraft-gtk-theme-dracula
archcraft-gtk-theme-easy
archcraft-gtk-theme-everforest
archcraft-gtk-theme-groot
archcraft-gtk-theme-gruvbox
archcraft-gtk-theme-hack
archcraft-gtk-theme-juno
archcraft-gtk-theme-kripton
archcraft-gtk-theme-manhattan
archcraft-gtk-theme-nordic
archcraft-gtk-theme-rick
archcraft-gtk-theme-slime
archcraft-gtk-theme-spark
archcraft-gtk-theme-sweet
archcraft-gtk-theme-wave
archcraft-gtk-theme-white
archcraft-gtk-theme-windows
archcraft-hooks
archcraft-hooks-extra
archcraft-hooks-zsh
archcraft-icons-arc
archcraft-icons-breeze
archcraft-icons-hack
archcraft-icons-luna
archcraft-icons-luv
archcraft-icons-nordic
archcraft-icons-numix
archcraft-icons-papirus
archcraft-icons-qogir
archcraft-icons-white
archcraft-icons-win11
archcraft-icons-zafiro
archcraft-mirrorlist
archcraft-music
archcraft-neofetch
archcraft-omz
archcraft-plymouth-theme
archcraft-randr
archcraft-ranger
archcraft-sddm-theme
archcraft-vim
archlinux-xdg-menu
archlinuxcn-keyring
ark
atril
aurorae
autoconf
automake
axel
b43-fwcutter
base
betterlockscreen
bind
bison
bluedevil
blueman
bluez
bluez-utils
bottom
breeze
breeze-gtk
breeze-plymouth
brltty
broadcom-wl
btrfs-progs
bzip2
cliphist
clonezilla
cloud-init
cowsay
cpio
cryptsetup
cups
cups-filters
cups-pdf
daed
dbeaver
debugedit
dhclient
dhcpcd
dialog
diffutils
discover
dmidecode
dmraid
dnsmasq
docker
docker-compose
dolphin
dosfstools
downgrade
drkonqi
dunst
e2fsprogs
edk2-shell
efibootmgr
epiphany
ethtool
exfatprogs
f2fs-tools
fakeroot
fastfetch
fatresize
fcitx5
fcitx5-chinese-addons
fcitx5-configtool
fcitx5-pinyin-chinese-idiom
fcitx5-pinyin-custom-pinyin-dictionary
fcitx5-pinyin-zhwiki
fd
ffmpeg
ffmpegthumbnailer
firefox
flatpak-kcm
flex
foomatic-db
foomatic-db-engine
foot
foot-terminfo
fortune-mod
fprintd
fsarchiver
galculator
gcc
geany
geany-plugins
ghostscript
gnome-keyring
gpart
gparted
gpm
gptfdisk
grim
grub
gsfonts
gst-libav
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-good
gst-plugins-ugly
gstreamer
gtk-engine-murrine
gtk3-nocsd-git
gutenprint
gvfs
gvfs-afc
gvfs-google
gvfs-gphoto2
gvfs-mtp
gvfs-smb
gzip
hdparm
highlight
htop
hyperv
hypridle
hyprland
hyprlock
hyprpaper
i3lock-color
inetutils
inotify-tools
iw
iwd
jasper
jfsutils
jq
kactivitymanagerd
kate
kde-cli-tools
kde-gtk-config
kdeconnect
kdecoration
kdeplasma-addons
keepassxc-qt6
kgamma
kglobalacceld
kinfocenter
kitty
kmenuedit
konsole
kpipewire
krdp
kscreen
kscreenlocker
ksshaskpass
ksuperkey
ksystemstats
kvantum
kwallet-pam
kwayland
kwin
kwin-x11
larksuite-bin
layer-shell-qt
lazygit
less
libavif
libde265
libdv
libfido2
libfprint-2-tod1-goodix-v2
libheif
libkscreen
libksysguard
libmpeg2
libplasma
libreoffice-still-zh-cn
libtheora
libusb-compat
libvpx
libwebp
light
linux
linux-atm
linux-firmware
linux-firmware-marvell
linux-headers
linux-lts
linux-lts-headers
lrzip
lsb-release
lsd
lsscsi
lvm2
lz4
lzip
lzop
maim
make
mako
man-db
man-pages
mdadm
meld
mesa
mesa-utils
meson
milou
mkinitcpio
mkinitcpio-firmware
mkinitcpio-nfs-utils
modemmanager
mpc
mpd
mpd-mpris
mplayer
mtools
nano
nbd
ncdu
ncmpcpp
ndisc6
neovim
net-tools
nethogs
network-manager-applet
network-manager-sstp
networkmanager
networkmanager-dmenu-git
networkmanager-openconnect
networkmanager-openvpn
networkmanager-pptp
networkmanager-strongswan
networkmanager-vpnc
nfs-utils
nginx
nginx-mod-stream
nilfs-utils
nitrogen
nm-connection-editor
nmap
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
npm
ntfs-3g
nvme-cli
nwg-look
ocean-sound-theme
open-iscsi
openconnect
openssh
openvpn
os-prober
oxygen
oxygen-sounds
partclone
parted
partimage
paru
pastel
patch
pavucontrol
pavucontrol-qt
pcsclite
perl-linux-desktopfiles
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
pkgconf
plasma-activities-stats
plasma-browser-integration
plasma-desktop
plasma-disks
plasma-firewall
plasma-integration
plasma-nm
plasma-pa
plasma-sdk
plasma-systemmonitor
plasma-thunderbolt
plasma-vault
plasma-welcome
plasma-workspace
plasma-workspace-wallpapers
plasma5support
plymouth
plymouth-kcm
polkit
polkit-kde-agent
polybar
postgresql
powerdevil
powertop
ppp
pptpclient
prettier
print-manager
pulsemixer
pv
python-pip
python-pywal
qqc2-breeze-style
qt6ct-kde
qutebrowser
ranger
refind
reflector
reiserfsprogs
ripgrep
rofi
rp-pppoe
rsync
rxvt-unicode-terminfo
schroedinger
screen
sddm-git
sddm-kcm
sdparm
sg3_utils
simplescreenrecorder
slop
slurp
smartmontools
sof-firmware
spectacle
squashfs-tools
stylua
sudo
swappy
swaybg
swayidle
swaylock
swaync
swww-git
syncthing
systemd-resolvconf
systemsettings
tcpdump
terminus-font
thefuck
thinkfan
thinkfan-ui
timeshift
tlp
tlpui
tmux
tpm2-tss
trash-cli
triliumnext-bin
tumbler
udftools
udisks2
ueberzug
unarchiver
unrar
unzip
update-grub
usb_modeswitch
usbmuxd
usbutils
viewnior
vim
visual-studio-code-bin
vpnc
wacomtablet
waybar
wemeet-wayland-screenshare-git
whitesur-kde-theme
wiliwili
wireless-regdb
wireless_tools
wireplumber
wlogout
wlsunset
wmctrl
wmname
wpa_supplicant
wvdial
x264
x265
xclip
xcolor
xdg-desktop-portal-hyprland
xdg-desktop-portal-kde
xdg-desktop-portal-wlr
xdg-user-dirs
xdg-user-dirs-gtk
xdotool
xf86-input-libinput
xf86-video-amdgpu
xf86-video-ati
xf86-video-fbdev
xf86-video-vesa
xfce-polkit
xfce4-power-manager
xfce4-settings
xfce4-terminal
xfsprogs
xl2tpd
xmlstarlet
xorg-bdftopcf
xorg-docs
xorg-font-util
xorg-fonts-100dpi
xorg-fonts-75dpi
xorg-fonts-encodings
xorg-iceauth
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-server-devel
xorg-server-xephyr
xorg-server-xnest
xorg-server-xvfb
xorg-sessreg
xorg-setxkbmap
xorg-smproxy
xorg-x11perf
xorg-xauth
xorg-xbacklight
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinput
xorg-xkbcomp
xorg-xkbevd
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xmodmap
xorg-xpr
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xrefresh
xorg-xset
xorg-xsetroot
xorg-xvinfo
xorg-xwayland
xorg-xwd
xorg-xwininfo
xorg-xwud
xsettingsd
xvidcore
xz
yarn
yay
yazi
zip
zoxide
zsh
zstd
